---
kind: property
id: P:Autodesk.Revit.DB.DefinitionFile.Filename
source: html/b0b0453e-d3e5-ee25-bab1-4d08482cc7a7.htm
---
# Autodesk.Revit.DB.DefinitionFile.Filename Property

This property returns the physical filename of the shared parameters file on disk.

## Syntax (C#)
```csharp
public string Filename { get; }
```